/*
 * 22.05.2018
 * Добавить возможность регистрации новых пользователей. ++ 23.05
 * Сохраняемые настройки для каждого пользователя. ++ 23.05
 * Доделать определения поражения, победы. ++ 23.05
 * Добавить в генерацию FEN проверку на рокировку и последний ход если пешка (Для стокфиша) ++ 23.05 
 * Добавить возможность продолжения игры.(Сохранение) ++ 23.05
 * 
 * 23.05.2018
 * Доделать возможность продолжение игры (Основываясь на настройках самой игры, а не только на настройки пользователя). ++ 24.05
 * Добавить кнопочку выхода из аккаунта. ++ 24.05
 * Добавить в сцену победы информацию о количестве сделанных ходов. ++ 25.05
 * 
 * 25.05.2018
 * Добавить в сцену победы информацию о количестве сделанных ходов + добавить окончание в зависимости от числа.
 * Добавить рейтинг(Начальный 1000 За победу над аи легкого уровня сложности +10 +20 +50 +100)
 * Добавить сцену с рейтингом игроков.
 */